[
    {
        "title": "Новий район",
        "desc": "<!DOCTYPE html>\n<html lang=\"uk\">\n<head>\n    <meta charset=\"UTF-8\">\n    <meta name=\"viewport\" content=\"width=device-width, initial-scale=1.0\">\n    <title>Mansory - GTA 5 Server</title>\n    <style>\n        body {\n            font-family: Arial, sans-serif;\n            line-height: 1.6;\n        }\n        h1, h2 {\n            color: #333;\n        }\n        .welcome {\n            font-style: italic;\n            margin-top: 30px;\n        }\n        .features {\n            margin: 20px 0;\n        }\n        ul {\n            padding-left: 20px;\n        }\n    </style>\n</head>\n<body>\n    <h1>Вітаємо вас на Mansory</h1>\n    <p>Цей пост - наш перший крок назустріч вам. Ми хочемо розповісти, хто ми, що створюємо, і як бачимо ідеальний сервер GTA 5.</p>\n    <p>Наша команда - це люди, які почали свою подорож до ігрового світу GTA ще у 2010 році з сервера SA-MP. Вже до 2012 року ми стали розробниками унікального проєкту, який не мав аналогів. Ці роки подарували нам неоціненний досвід, який тепер допомагає втілювати мрію - створити власний сервер.</p>\n    <p>Mansory для нас - більше, ніж хобі. Ця гра супроводжувала нас із дитинства і стала частиною життя. Ми знаємо, яким має бути справді якісний сервер. Наш проєкт будується з нуля, без запозичень і шаблонів.</p>\n    <p>Останні роки ми грали на найрізноманітніших серверах GTA 5, і багато хто з них гідні поваги. Але з початком війни ми повністю втратили інтерес до російських проектів і припинили грати. Проте бажання повернутися в гру залишилося. Ми зрозуміли: настав час реалізувати власне бачення.</p>\n    <p>Ми не прагнемо винайти «велосипед». Ми робимо сервер, який стане унікальним завдяки нашій філософії. Безліч ідей для систем ми черпаємо з інших ігор, адаптуючи їх під унікальний світ Mansory.</p>\n    <p>Ми хочемо, щоб на нашому сервері могли комфортно грати як великі компанії друзів, так і ті, хто вважає за краще проводити час на самоті під улюблену музику або фільм.</p>\n    <h2>Що робить Mansory особливим?</h2>\n    <ul class=\"features\">\n        <li>Сервер створюється повністю з нуля, без шаблонів.</li>\n        <li>Наші системи не прагнуть до складності заради складності. Це логічні, взаємопов'язані механіки, які відображають продуману економіку та ігрові процеси.</li>\n        <li>Mansory - де офіційна мова проєкту - українська. Ми створюємо простір, де звучить українська мова.</li>\n    </ul>\n    <p>Ми запрошуємо вас приєднатися до наших соціальних мереж. Ваші відгуки, ідеї та активність - це те, що надихатиме нас рухатися далі. Mansory створюється для вас, для вашого задоволення та незабутніх пригод.</p>\n    <p class=\"welcome\"><em>Ласкаво просимо до Mansory</em></p>\n</body>\n</html>",
        "date": "12.12.2024",
        "img": ""
    }
]
