[
    {
        "title": "Вітаємо вас на Mansory!",
        "desc": "Цей пост - наш перший крок назустріч вам. Ми хочемо розповісти, хто ми, що створюємо, і як бачимо ідеальний сервер GTA 5.</p>\n<p>Наша команда - це люди, які почали свою подорож до ігрового світу GTA ще у 2010 році з сервера SA-MP. Вже до 2012 року ми стали розробниками унікального проєкту, який не мав аналогів. Ці роки подарували нам неоціненний досвід, який тепер допомагає втілювати мрію - створити власний сервер.</p>\n<p>Mansory для нас - більше, ніж хобі. Ця гра супроводжувала нас із дитинства і стала частиною життя. Ми знаємо, яким має бути справді якісний сервер. Наш проєкт будується з нуля, без запозичень і шаблонів.</p>\n<p>Останні роки ми грали на найрізноманітніших серверах GTA 5, і багато хто з них гідні поваги. Але з початком війни ми повністю втратили інтерес до російських проектів і припинили грати. Проте бажання повернутися в гру залишилося. Ми зрозуміли: настав час реалізувати власне бачення.</p>\n<p>Ми не прагнемо винайти «велосипед». Ми робимо сервер, який стане унікальним завдяки нашій філософії. Безліч ідей для систем ми черпаємо з інших ігор, адаптуючи їх під унікальний світ Mansory.</p>\n<p>Ми хочемо, щоб на нашому сервері могли комфортно грати як великі компанії друзів, так і ті, хто вважає за краще проводити час на самоті під улюблену музику або фільм.</p>\n<h2>Що робить Mansory особливим?</h2>\n<ul class=\"features\">\n    <li>Сервер створюється повністю з нуля, без шаблонів.</li>\n    <li>Наші системи не прагнуть до складності заради складності. Це логічні, взаємопов'язані механіки, які відображають продуману економіку та ігрові процеси.</li>\n    <li>Mansory - де офіційна мова проєкту - українська. Ми створюємо простір, де звучить українська мова.</li>\n</ul>\n<p>Ми запрошуємо вас приєднатися до наших соціальних мереж. Ваші відгуки, ідеї та активність - це те, що надихатиме нас рухатися далі. Mansory створюється для вас, для вашого задоволення та незабутніх пригод.</p>\n<p class=\"welcome\"><em>Ласкаво просимо до Mansory</em></p>",
        "date": "12.12.2024",
        "img": "https://i.imgur.com/r92iPup.png",
        "link": "https://forum.mansory-rp.com/index.php?threads/%D0%9F%D0%B0%D1%82%D1%87-%D0%BE%D0%BD%D0%BE%D0%B2%D0%BB%D0%B5%D0%BD%D1%8C-26-12-2024.16/#post-19"
    },
    {
        "title": "Патч оновлень 26.12.2024",
		"desc": "<p>Було повністю перероблено меню вибору персонажів, щоб зробити його більш мінімалістичним, інтуїтивно зрозумілим і естетично привабливим. Додано можливість створювати до 4 персонажів зі зручним перемиканням між ними. Також покращено візуальне оформлення та анімації, оптимізовано продуктивність інтерфейсу та виправлено дрібні баги, пов'язані з відображенням інформації про персонажів.</p>\n<p><strong>Система інвентаря</strong></p>\n<ul>\n    <li>Додано можливість викидати предмети: один, два, половину тощо.</li>\n    <li>На місці викиду створюється предмет (без колізії).</li>\n    <li>Термін збереження предметів на землі.</li>\n    <li>Виправлено кількість предметів при викиданні (правильний підрахунок залишків).</li>\n    <li>Додано відображення назви та кількості предметів на землі:</li>\n        <li>Оточуючі бачать процес скидання або підняття предметів.</li>\n    <li>Виправлено \"перескакування\" предметів: якщо предмет забрано, він стає напівпрозорим.</li>\n    <li>Декілька нових предметів (зброя, їжа, аптечки).</li>\n</ul>\n<p><strong>Система одягу</strong></p>\n<ul>\n    <li>Налаштовані всі предмети одягу (можна одягти всі слоти, окрім броні, маски та рюкзака — вони будуть в іншій системі).</li>\n    <li>В інвентарі перевіряється гендер відповідного одягу.</li>\n    <li>Для верхнього одягу додано торси (70% налаштовано).</li>\n    <li>Редагований список текстур для одягу.</li>\n    <li>При завантаженні персонажа автоматично надягається одяг із його інвентаря.</li>\n    <li>При виборі персонажа на клієнт передаються дані про одяг (раніше всі були у футболках).</li>\n</ul>\n<p><strong>Магазини та бізнеси</strong></p>\n<ul>\n    <li><em>Магазин одягу:</em>\n        <ul>\n            <li>Завантажує дані про наявність із бази.</li>\n            <li>Для кожного предмета додано параметр, у якому магазині він продається (звичайний, люкс, бізнес).</li>\n            <li>Інтерфейс магазину: фільтри, сортування за ціною та назвою.</li>\n            <li>Камера в магазині наближається до персонажа, із можливістю крутити навколо нього (по висоті та сторонам).</li>\n            <li>При вході гравець телепортується на задане місце, при виході — повертається назад.</li>\n        </ul>\n    </li>\n    <li><em>Заправки:</em>\n        <ul>\n            <li>Система пального для авто (без витрати, поки що).</li>\n        </ul>\n    </li>\n</ul>",
		"date": "25.12.2024",
        "link": "https://forum.mansory-rp.com/index.php?threads/%D0%9F%D0%B0%D1%82%D1%87-%D0%BE%D0%BD%D0%BE%D0%B2%D0%BB%D0%B5%D0%BD%D1%8C-26-12-2024.16/#post-19"
    },
	{
        "title": "Підтримка проекту Mansory RP",
        "desc": "Mansory RP – це команда ентузіастів, які вкладають свої сили, час і ресурси у створення проекту. На даний момент наш проект повністю тримається на особистих вкладеннях, але для його подальшого розвитку нам потрібна підтримка спільноти.</p>\n\n<h2>Усе, що ми отримуємо від вас, буде спрямовано на поліпшення сервера:</h2>\n<ul>\n<li>Купівля більш потужного обладнання для комфортної гри.</li>\n<li>Впровадження якісних і унікальних моделей одягу, автомобілів, аксесуарів.</li>\n<li>Реклама для залучення нових гравців, яка потребує ресурсів та професійного підходу.</li>\n<li>Послуги професіоналів, таких як проджект-менеджери, контент-менеджери.</li>\n</ul>\n\n<h2>Як ви можете допомогти:</h2>\n<p>Будь-яка допомога, фінансова чи інша, буде для нас безцінною. Ви можете не тільки підтримати нас матеріально, а й долучитися до тестування, розробки чи інших завдань.</p>\n\n<h2>Що ми пропонуємо за вашу підтримку:</h2>\n<ul>\n<li>Ексклюзивні ролі в Discord.</li>\n<li>Привілеї в грі, які збережуться назавжди.</li>\n</ul>\n\n<h2>Як зробити внесок:</h2>\n<p>Якщо ви хочете зробити свій внесок, будь ласка, зв'яжіться з керівництвом проєкту через будь-яку соціальну мережу або заповніть форму зворотного зв'язку.</p>\n\n<p>Ваша підтримка - це не просто допомога, це внесок у наше спільне майбутнє. Дякуємо, що ви з нами!</p>",
        "date": "18.12.2024",
        "link": "https://forum.mansory-rp.com/index.php?threads/%D0%A0%D0%BE%D0%B7%D0%B2%D0%B8%D1%82%D0%BE%D0%BA-%D0%BF%D1%80%D0%BE%D0%B5%D0%BA%D1%82%D1%83.15/#post-18"
    }
    ,
    {
        "title": "Щотижневик розробки проекту Mansory",
        "desc": "<p>Привіт, друзі! Ми раді оголосити про запуск нового формату на нашому сайті - щотижневих звітів з розробки нашого сервера! Щотижня ми будемо ділитися з вами важливими оновленнями, новими функціями та цікавими подробицями зі світу розробки.</p>\n<p><strong>Що на вас чекає?</strong> У наших відео-звітах ми будемо детально розповідати про те, які системи було реалізовано, які проблеми ми розв'язували та які завдання стоять перед нами на наступний тиждень. Це не просто звичайні технічні звіти - ми постараємося зробити їх максимально захопливими та доступними, щоб навіть ті, хто не пов'язаний із розробкою, могли зрозуміти, як ми створюємо унікальний досвід для гравців.</p>\n<p>Щотижня ми публікуватимемо короткі відеоролики, в яких продемонструємо, як рухається наш проєкт. Не пропустіть шанс зазирнути за лаштунки розробки та побачити, як еволюціонує світ Mansory!</p>\n<p>Приєднуйтесь, слідкуйте за нашими новими відео та залишайтеся в курсі всіх подій - попереду багато цікавого!</p>\n<p style=\"text-align:center;\">\n    <div style=\"position:relative; padding-bottom: 56.25%; height: 0; overflow: hidden; max-width: 100%;\">\n        <iframe style=\"position:absolute; top:0; left:0; width: 100%; height: 100%;\" src=\"https://www.youtube.com/embed/n1F9eVHGWE0\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>\n    </div>\n</p>",
        "date": "26.12.2024",
        "link": "https://www.youtube.com/watch?v=n1F9eVHGWE0"
    }
    
    
    
    
    
    
    
]
